# SQL Assignment: Filtering and Sorting | Solution

This notebook provides the solution for the SQL assignment based on the **Employees** dataset. It covers creating the table, inserting data, and performing various **Filtering (WHERE)** and **Sorting (ORDER BY)** operations.

**Note:** We will use Python's `sqlite3` library to simulate the SQL environment so you can run and verify these queries directly in this notebook.

## 1. Database Setup & Table Creation

First, we create the `Employees` table and insert the dummy data provided in the assignment.

In [46]:
import sqlite3
import pandas as pd

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the Employees table
cursor.execute('''
CREATE TABLE Employees (
    EmpID INTEGER PRIMARY KEY,
    EmpName TEXT,
    Department TEXT,
    City TEXT,
    Salary INTEGER,
    HireDate DATE
)
''')

# Insert the sample data provided in the assignment
employees_data = [
    (101, 'Rahul Mehta', 'Sales', 'Delhi', 55000, '2020-04-12'),
    (102, 'Priya Sharma', 'HR', 'Mumbai', 62000, '2019-09-25'),
    (103, 'Aman Singh', 'IT', 'Bengaluru', 72000, '2021-03-10'),
    (104, 'Neha Patel', 'Sales', 'Delhi', 48000, '2022-01-14'),
    (105, 'Karan Joshi', 'Marketing', 'Pune', 45000, '2018-07-22'),
    (106, 'Divya Nair', 'IT', 'Chennai', 81000, '2019-12-11'),
    (107, 'Raj Kumar', 'HR', 'Delhi', 60000, '2020-05-28'),
    (108, 'Simran Kaur', 'Finance', 'Mumbai', 58000, '2021-08-03'),
    (109, 'Arjun Reddy', 'IT', 'Hyderabad', 70000, '2021-06-15'),
    (110, 'Ravi Verma', 'Sales', 'Mumbai', 52000, '2019-03-18')
]

cursor.executemany('INSERT INTO Employees VALUES (?,?,?,?,?,?)', employees_data)
conn.commit()
print("Database setup complete. 'Employees' table created and populated.")

Database setup complete. 'Employees' table created and populated.

## 2. Data Verification
Let's display the entire table to ensure the data is loaded correctly.

In [47]:
query = "SELECT * FROM Employees"
pd.read_sql_query(query, conn)

   EmpID       EmpName Department       City  Salary    HireDate
0    101   Rahul Mehta      Sales      Delhi   55000  2020-04-12
1    102  Priya Sharma         HR     Mumbai   62000  2019-09-25
2    103    Aman Singh         IT  Bengaluru   72000  2021-03-10
3    104    Neha Patel      Sales      Delhi   48000  2022-01-14
4    105   Karan Joshi  Marketing       Pune   45000  2018-07-22
5    106    Divya Nair         IT    Chennai   81000  2019-12-11
6    107     Raj Kumar         HR      Delhi   60000  2020-05-28
7    108   Simran Kaur    Finance     Mumbai   58000  2021-08-03
8    109   Arjun Reddy         IT  Hyderabad   70000  2021-06-15
9    110    Ravi Verma      Sales     Mumbai   52000  2019-03-18

## Part 1: Filtering Data (WHERE Clause)

This section covers tasks related to filtering rows based on specific conditions.

### Question 1: Show employees working in either the 'IT' or 'HR' departments.

In [48]:
query = "SELECT * FROM Employees WHERE Department IN ('IT', 'HR')"
pd.read_sql_query(query, conn)

   EmpID       EmpName Department       City  Salary    HireDate
0    102  Priya Sharma         HR     Mumbai   62000  2019-09-25
1    103    Aman Singh         IT  Bengaluru   72000  2021-03-10
2    106    Divya Nair         IT    Chennai   81000  2019-12-11
3    107     Raj Kumar         HR      Delhi   60000  2020-05-28
4    109   Arjun Reddy         IT  Hyderabad   70000  2021-06-15

### Question 2: Retrieve employees whose department is in 'Sales', 'IT', or 'Finance'.

In [49]:
query = "SELECT * FROM Employees WHERE Department IN ('Sales', 'IT', 'Finance')"
pd.read_sql_query(query, conn)

   EmpID      EmpName Department       City  Salary    HireDate
0    101  Rahul Mehta      Sales      Delhi   55000  2020-04-12
1    103   Aman Singh         IT  Bengaluru   72000  2021-03-10
2    104   Neha Patel      Sales      Delhi   48000  2022-01-14
3    106   Divya Nair         IT    Chennai   81000  2019-12-11
4    108  Simran Kaur    Finance     Mumbai   58000  2021-08-03
5    109  Arjun Reddy         IT  Hyderabad   70000  2021-06-15
6    110   Ravi Verma      Sales     Mumbai   52000  2019-03-18

### Question 3: Display employees whose salary is between ₹50,000 and ₹70,000.

In [50]:
query = "SELECT * FROM Employees WHERE Salary BETWEEN 50000 AND 70000"
pd.read_sql_query(query, conn)

   EmpID       EmpName Department       City  Salary    HireDate
0    101   Rahul Mehta      Sales      Delhi   55000  2020-04-12
1    102  Priya Sharma         HR     Mumbai   62000  2019-09-25
2    107     Raj Kumar         HR      Delhi   60000  2020-05-28
3    108   Simran Kaur    Finance     Mumbai   58000  2021-08-03
4    109   Arjun Reddy         IT  Hyderabad   70000  2021-06-15
5    110    Ravi Verma      Sales     Mumbai   52000  2019-03-18

### Question 4: List employees whose names start with the letter 'A'.

In [51]:
query = "SELECT * FROM Employees WHERE EmpName LIKE 'A%'"
pd.read_sql_query(query, conn)

   EmpID      EmpName Department       City  Salary    HireDate
0    103   Aman Singh         IT  Bengaluru   72000  2021-03-10
1    109  Arjun Reddy         IT  Hyderabad   70000  2021-06-15

### Question 5: Find employees whose names contain the substring 'an'.

In [52]:
query = "SELECT * FROM Employees WHERE EmpName LIKE '%an%'"
pd.read_sql_query(query, conn)

   EmpID      EmpName Department       City  Salary    HireDate
0    103   Aman Singh         IT  Bengaluru   72000  2021-03-10
1    105  Karan Joshi  Marketing       Pune   45000  2018-07-22
2    108  Simran Kaur    Finance     Mumbai   58000  2021-08-03

### Question 6: Show employees who are from 'Delhi' or 'Mumbai' and earn more than ₹55,000.

In [53]:
query = "SELECT * FROM Employees WHERE (City = 'Delhi' OR City = 'Mumbai') AND Salary > 55000"
pd.read_sql_query(query, conn)

   EmpID       EmpName Department    City  Salary    HireDate
0    102  Priya Sharma         HR  Mumbai   62000  2019-09-25
1    107     Raj Kumar         HR   Delhi   60000  2020-05-28
2    108   Simran Kaur    Finance  Mumbai   58000  2021-08-03

### Question 7: Display all employees except those from the 'HR' department.

In [54]:
query = "SELECT * FROM Employees WHERE Department != 'HR'"
pd.read_sql_query(query, conn)

   EmpID      EmpName Department       City  Salary    HireDate
0    101  Rahul Mehta      Sales      Delhi   55000  2020-04-12
1    103   Aman Singh         IT  Bengaluru   72000  2021-03-10
2    104   Neha Patel      Sales      Delhi   48000  2022-01-14
3    105  Karan Joshi  Marketing       Pune   45000  2018-07-22
4    106   Divya Nair         IT    Chennai   81000  2019-12-11
5    108  Simran Kaur    Finance     Mumbai   58000  2021-08-03
6    109  Arjun Reddy         IT  Hyderabad   70000  2021-06-15
7    110   Ravi Verma      Sales     Mumbai   52000  2019-03-18

### Question 8: Get all employees hired between 2019 and 2022, ordered by HireDate (oldest first).

In [55]:
query = "SELECT * FROM Employees WHERE HireDate BETWEEN '2019-01-01' AND '2022-12-31' ORDER BY HireDate ASC"
pd.read_sql_query(query, conn)

   EmpID       EmpName Department       City  Salary    HireDate
0    110    Ravi Verma      Sales     Mumbai   52000  2019-03-18
1    102  Priya Sharma         HR     Mumbai   62000  2019-09-25
2    106    Divya Nair         IT    Chennai   81000  2019-12-11
3    101   Rahul Mehta      Sales      Delhi   55000  2020-04-12
4    107     Raj Kumar         HR      Delhi   60000  2020-05-28
5    103    Aman Singh         IT  Bengaluru   72000  2021-03-10
6    109   Arjun Reddy         IT  Hyderabad   70000  2021-06-15
7    108   Simran Kaur    Finance     Mumbai   58000  2021-08-03
8    104    Neha Patel      Sales      Delhi   48000  2022-01-14